abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
#include "ch32v00x.h"
#include "ch32v00x_exti.h"
#include "ch32v00x_flash.h"
#include "ch32v00x_gpio.h"
#include "ch32v00x_misc.h"
#include "ch32v00x_pwr.h"
#include "ch32v00x_rcc.h"
#include "ch32v00x_tim.h"
#include "ch32v00x_usart.h"
#include "config.h"
#include "debug.h"
#include "nrf24_simple.h"
#include <stdint.h>
#include <string.h>

/* ========== Function Prototypes ========== */
void gpio_init(void);
void adc_init(void);
void exti_init(void);
void pwr_sleep_init(void);
void timer_init(void);
void enter_deep_sleep(void);
void flash_read_settings(void);
void flash_save_settings(void);
uint8_t read_tank_level(void);
uint8_t read_battery_level(void);
void run_pairing(void);
uint32_t millis(void);
uint8_t calculate_checksum(uint8_t *data, uint8_t length);

typedef struct {
  uint32_t button_press_start;
  bool pairing_triggered;
  uint16_t sleep_cycle_count;
  uint32_t seq_num;
  uint8_t last_sent_level;
  uint8_t filtered_level;
  uint8_t stable_counter;
  bool first_reading_done;
  uint8_t current_battery;
  uint8_t retry_cooldown;
} runtime_state_t;

typedef enum {
  BUTTON_ACTION_NONE = 0,
  BUTTON_ACTION_RESET,
  BUTTON_ACTION_FACTORY_RESET,
} button_action_t;

typedef enum {
  TX_WAIT_TIMEOUT = 0,
  TX_WAIT_ACK_RECEIVED,
  TX_WAIT_LEVEL_CHANGED,
  TX_WAIT_ABORTED,
} tx_wait_result_t;

typedef enum {
  TX_SEND_NO_ACK = 0,
  TX_SEND_ACKED,
  TX_SEND_RESTART_LEVEL,
  TX_SEND_ABORTED,
} tx_send_result_t;

static volatile uint8_t g_sensor_event_pending = 0;
static volatile uint8_t g_button_event_pending = 0;
static runtime_state_t g_runtime;

/* ========== Power Management & AWU ========== */
void pwr_sleep_init(void) {
  // Enable PWR clock
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);

  // Configure AWU (Auto Wake-up)
  RCC_LSICmd(ENABLE);
  while (RCC_GetFlagStatus(RCC_FLAG_LSIRDY) == RESET)
    ;

  // Set AWU prescaler and window for ~10s wake-up (Faster response)
  PWR_AWU_SetPrescaler(PWR_AWU_Prescaler_61440);
  PWR_AWU_SetWindowValue(8);
  PWR_AutoWakeUpCmd(ENABLE);

  // Enable AWU interrupt in NVIC
  NVIC_InitTypeDef NVIC_InitStructure = {0};
  NVIC_InitStructure.NVIC_IRQChannel = AWU_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

void AWU_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void AWU_IRQHandler(void) {
  // AWU does not have a specific IT pending bit to clear in most V003 versions,
  // it's cleared by hardware or by the wake-up process.
}

void exti_init(void) {
  // Enable AFIO clock BEFORE configuring line mapping
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);

  EXTI_InitTypeDef EXTI_InitStructure = {0};

  // Sensor Pins on Port C: PC0, PC1, PC2, PC4
  GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource0);
  GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource1);
  GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource2);
  GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource4);

  EXTI_InitStructure.EXTI_Line =
      EXTI_Line0 | EXTI_Line1 | EXTI_Line2 | EXTI_Line4;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  // Button Pin on Port D: PD6
  GPIO_EXTILineConfig(GPIO_PortSourceGPIOD, GPIO_PinSource6);
  EXTI_InitStructure.EXTI_Line = EXTI_Line6;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
  EXTI_Init(&EXTI_InitStructure);

  // Enable NVIC for EXTI Line 7-0
  NVIC_InitTypeDef NVIC_InitStructure = {0};
  NVIC_InitStructure.NVIC_IRQChannel = EXTI7_0_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

void EXTI7_0_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void EXTI7_0_IRQHandler(void) {
  if (EXTI_GetITStatus(EXTI_Line0) != RESET ||
      EXTI_GetITStatus(EXTI_Line1) != RESET ||
      EXTI_GetITStatus(EXTI_Line2) != RESET ||
      EXTI_GetITStatus(EXTI_Line4) != RESET) {
    g_sensor_event_pending = 1;
  }

  if (EXTI_GetITStatus(EXTI_Line6) != RESET) {
    g_button_event_pending = 1;
  }

  // Clear all pending flags for sensor pins and button
  EXTI_ClearITPendingBit(EXTI_Line0 | EXTI_Line1 | EXTI_Line2 | EXTI_Line4 |
                         EXTI_Line6);
}

void enter_deep_sleep(void) {
  DEBUG_PRINT("[PWR] Sleep\r\n");
  Delay_Ms(50); // Increased UART flush time

  // Clear pending flags for a clean start
  EXTI->INTFR = 0xFFFFFFFF;

  // Use "Stop" mode (SLEEPDEEP=1, PDDS=0)
  // This mode allows EXTI (Sensor changes) to wake up the MCU
  PWR->CTLR &= ~PWR_CTLR_PDDS; // PDDS = 0
  NVIC->SCTLR |= (1 << 2);     // Set SLEEPDEEP

  __WFI(); // Wait for Interrupt (AWU or EXTI)

  NVIC->SCTLR &= ~(1 << 2); // Clear SLEEPDEEP after wakeup

  // System resumes here after wake up
  SystemCoreClockUpdate();

  // Clear flags again after waking to prevent fast loops
  EXTI->INTFR = 0xFFFFFFFF;

  DEBUG_PRINT("[PWR] Wake\r\n");

  // Visual confirmation of wakeup
  GPIO_ResetBits(GPIOD, LED_PIN); // Blink ON
  Delay_Ms(50);
  GPIO_SetBits(GPIOD, LED_PIN); // Blink OFF

  // Essential re-init after deep sleep
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOC |
                             RCC_APB2Periph_GPIOA | RCC_APB2Periph_ADC1 |
                             RCC_APB2Periph_AFIO,
                         ENABLE);
  gpio_init(); // Re-init all GPIO modes correctly (also calls exti_init)
  adc_init();  // Re-calibrate ADC after wake up
  exti_init(); // Re-enable EXTI wake triggers

  Delay_Ms(200); // Stabilization delay
}

/* ========== Flash Storage (Last Page 64-byte) ========== */
#define SETTINGS_FLASH_ADDR 0x08003FC0
typedef struct {
  uint16_t tank_id;
  uint8_t pairing_status; // 1 = Paired, 0 = Not Paired
} sensor_settings_t;

