abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
sensor_settings_t g_settings;

void flash_read_settings(void) {
  memcpy(&g_settings, (void *)SETTINGS_FLASH_ADDR, sizeof(sensor_settings_t));

  // Check if data is valid (not empty flash 0xFF)
  if (g_settings.tank_id == 0xFFFF) {
    g_settings.tank_id = 0;
    g_settings.pairing_status = 0;
  }
}

void flash_save_settings(void) {
  FLASH_Unlock();
  FLASH_ErasePage(SETTINGS_FLASH_ADDR);

  uint32_t *pData = (uint32_t *)&g_settings;
  for (uint16_t i = 0; i < (sizeof(sensor_settings_t) + 3) / 4; i++) {
    FLASH_ProgramWord(SETTINGS_FLASH_ADDR + (i * 4), pData[i]);
  }
  FLASH_Lock();
  DEBUG_PRINT("[FL] Saved ID:0x%04X S:%d\r\n",
              g_settings.tank_id, g_settings.pairing_status);
}

/* ========== Global Variables ========== */
const uint8_t PAIRING_ADDR[3] = {0xE7, 0xE7,
                                 0xE7}; // Address for pairing packets
volatile uint32_t g_millis = 0;         // Current system time in ms
uint8_t g_probe_fault = 0; // 1 = Fault detected (e.g., gap in readings)

static void reset_runtime_tracking(runtime_state_t *runtime) {
  runtime->button_press_start = 0;
  runtime->pairing_triggered = false;
  runtime->sleep_cycle_count = 0;
  runtime->seq_num = 0;
  runtime->last_sent_level = 0xFF;
  runtime->filtered_level = 0;
  runtime->stable_counter = 0;
  runtime->first_reading_done = false;
  runtime->current_battery = 0;
  runtime->retry_cooldown = 0;
  g_sensor_event_pending = 0;
  g_button_event_pending = 0;
}

static uint8_t sample_filtered_level(runtime_state_t *runtime) {
  uint8_t raw_level = read_tank_level();

  if (!runtime->first_reading_done) {
    runtime->filtered_level = raw_level;
    runtime->first_reading_done = true;
    runtime->stable_counter = 0;
    DEBUG_PRINT("[SYSTEM] Init Level: %d%%\r\n",
                runtime->filtered_level);
  } else if (raw_level == runtime->filtered_level) {
    runtime->stable_counter = 0;
  } else {
    runtime->stable_counter++;
    if (runtime->stable_counter >= 1) {
      runtime->filtered_level = raw_level;
      runtime->stable_counter = 0;
      DEBUG_PRINT("[SYS] LvlChg: %d%%\r\n",
                  runtime->filtered_level);
    }
  }

  return runtime->filtered_level;
}

static button_action_t poll_button_action(runtime_state_t *runtime) {
  if (GPIO_ReadInputDataBit(GPIOD, BUTTON_PIN) == 0) {
    if (runtime->button_press_start == 0) {
      runtime->button_press_start = millis();
      DEBUG_PRINT("[SYSTEM] Button Pressed\r\n");
    }

    if (!runtime->pairing_triggered &&
        (millis() - runtime->button_press_start) > RESET_PRESS_TIME_MS) {
      runtime->pairing_triggered = true;
      return BUTTON_ACTION_FACTORY_RESET;
    }

    return BUTTON_ACTION_NONE;
  }

  if (runtime->button_press_start == 0) {
    return BUTTON_ACTION_NONE;
  }

  uint32_t held_ms = millis() - runtime->button_press_start;
  runtime->button_press_start = 0;

  if (!runtime->pairing_triggered && held_ms > 10 &&
      held_ms < RESET_PRESS_TIME_MS) {
    runtime->pairing_triggered = false;
    if (g_settings.pairing_status == 1) {
      return BUTTON_ACTION_RESET;
    }

    return BUTTON_ACTION_NONE;
  }

  runtime->pairing_triggered = false;
  return BUTTON_ACTION_NONE;
}

static void send_unpair_before_reset(void) {
  DEBUG_PRINT("Sending UNPAIR before reset\r\n");

  uint8_t unpair_pkt[32] = {0};
  unpair_pkt[0] = 0xAA;
  unpair_pkt[1] = 0x55;
  unpair_pkt[2] = 0x06; // PKT_TYPE_UNPAIR
  unpair_pkt[3] = 32;
  unpair_pkt[4] = (uint8_t)(g_settings.tank_id & 0xFF);
  unpair_pkt[5] = (uint8_t)(g_settings.tank_id >> 8);
  unpair_pkt[31] = calculate_checksum(unpair_pkt, 32);

  nrf24_power_up_tx();
  nrf24_set_tx_addr(PAIRING_ADDR);
  for (int i = 0; i < 20; i++) {
    nrf24_send(unpair_pkt, 32);
    Delay_Ms(30);
  }
  nrf24_power_down();
}

static void handle_button_action(runtime_state_t *runtime,
                                 button_action_t action) {
  runtime->button_press_start = 0;
  runtime->pairing_triggered = false;
  g_button_event_pending = 0;

  if (action == BUTTON_ACTION_NONE) {
    return;
  }

  if (action == BUTTON_ACTION_FACTORY_RESET) {
    DEBUG_PRINT("[SYS] FACTORY RESET\r\n");

    if (g_settings.pairing_status == 1 && g_settings.tank_id != 0) {
      send_unpair_before_reset();
    }

    g_settings.tank_id = 0;
    g_settings.pairing_status = 0;
    flash_save_settings();

    reset_runtime_tracking(runtime);
    run_pairing();
    return;
  }

  DEBUG_PRINT("[SYS] Click -> Reset\r\n");
  Delay_Ms(100);
  NVIC->SCTLR |= (1 << 31); // SYSRESETREQ
}

static bool packet_matches_data_ack(uint8_t *packet, uint32_t seq_num) {
  if (packet[0] != 0xAA || packet[1] != 0x55 ||
      packet[2] != PKT_TYPE_DATA_ACK) {
    return false;
  }

  uint8_t crc = calculate_checksum(packet, 32);
  uint16_t ack_id = (uint16_t)packet[4] | ((uint16_t)packet[5] << 8);
  uint32_t ack_seq = (uint32_t)packet[6] | ((uint32_t)packet[7] << 8) |
                     ((uint32_t)packet[8] << 16) |
                     ((uint32_t)packet[9] << 24);

  return crc == packet[31] && ack_id == g_settings.tank_id &&
         ack_seq == seq_num;
}

static tx_wait_result_t service_runtime_window(runtime_state_t *runtime,
                                               uint32_t wait_ms,
                                               bool listen_for_ack,
                                               uint8_t attempt,
                                               uint32_t seq_num,
                                               uint8_t sent_level,
                                               uint8_t *latest_level) {
  uint32_t start = millis();

  while ((millis() - start) < wait_ms) {
    if (listen_for_ack && nrf24_available()) {
      uint8_t rx[32];
      nrf24_read(rx, 32);

      if (packet_matches_data_ack(rx, seq_num)) {
        DEBUG_PRINT("[ACK] OK try:%d\r\n", attempt);
        return TX_WAIT_ACK_RECEIVED;
      }

      for (uint8_t j = 0; j < 32; j++) {
        rx[j] = (uint8_t)~rx[j];
      }

      if (packet_matches_data_ack(rx, seq_num)) {
        DEBUG_PRINT("[ACK] OK(inv) try:%d\r\n", attempt);
        return TX_WAIT_ACK_RECEIVED;
      }
    }

    if (g_sensor_event_pending) {
      g_sensor_event_pending = 0;
      *latest_level = sample_filtered_level(runtime);
      if (*latest_level != sent_level) {
        DEBUG_PRINT("[TX] Lvl update during TX: %d%%\r\n",
                    *latest_level);
        return TX_WAIT_LEVEL_CHANGED;
      }
    }

    if (g_button_event_pending || runtime->button_press_start != 0 ||
        GPIO_ReadInputDataBit(GPIOD, BUTTON_PIN) == 0) {
      g_button_event_pending = 0;
      button_action_t action = poll_button_action(runtime);
      if (action != BUTTON_ACTION_NONE) {
        handle_button_action(runtime, action);
        return TX_WAIT_ABORTED;
      }
    }

    Delay_Ms(1);
  }

  return TX_WAIT_TIMEOUT;
}

static void prepare_data_packet(uint8_t *packet, uint8_t current_level) {
  memset(packet, 0, 32);

  packet[0] = 0xAA;
  packet[1] = 0x55;
  packet[2] = 0x02;
  packet[3] = 32;
  packet[4] = (uint8_t)(g_settings.tank_id & 0xFF);
  packet[5] = (uint8_t)(g_settings.tank_id >> 8);
  packet[6] = current_level;
  packet[7] = g_runtime.current_battery;

  packet[8] = 0;
  if (g_runtime.current_battery <= BATTERY_LOW_THRESHOLD) {
    packet[8] |= 0x01; // Low Battery Flag
  }

  packet[9] = g_probe_fault;
  packet[12] = (uint8_t)(g_runtime.seq_num & 0xFF);
  packet[13] = (uint8_t)((g_runtime.seq_num >> 8) & 0xFF);
  packet[14] = (uint8_t)((g_runtime.seq_num >> 16) & 0xFF);
  packet[15] = (uint8_t)((g_runtime.seq_num >> 24) & 0xFF);
  packet[31] = calculate_checksum(packet, 32);
}

