abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
static tx_send_result_t send_data_with_retry(runtime_state_t *runtime,
                                             uint8_t *packet,
                                             uint8_t *current_level) {
  nrf24_init();

  for (uint8_t attempt = 0; attempt < DATA_MAX_RETRIES; attempt++) {
    nrf24_power_up_tx();
    nrf24_set_tx_addr(PAIRING_ADDR);

    for (int burst = 0; burst < 3; burst++) {
      nrf24_send(packet, 32);

      tx_wait_result_t gap_result =
          service_runtime_window(runtime, 10, false, attempt,
                                 runtime->seq_num, *current_level,
                                 current_level);
      if (gap_result == TX_WAIT_LEVEL_CHANGED) {
        nrf24_power_down();
        return TX_SEND_RESTART_LEVEL;
      }
      if (gap_result == TX_WAIT_ABORTED) {
        nrf24_power_down();
        return TX_SEND_ABORTED;
      }
    }

    if (attempt == 0) {
      DEBUG_PRINT("[TX] Seq:%lu try:%d\r\n",
                  (unsigned long)runtime->seq_num, attempt);
    }

    nrf24_flush_rx();
    nrf24_power_up_rx();

    tx_wait_result_t ack_result =
        service_runtime_window(runtime, DATA_ACK_WAIT_MS, true,
                               attempt, runtime->seq_num,
                               *current_level, current_level);
    if (ack_result == TX_WAIT_ACK_RECEIVED) {
      nrf24_power_down();
      return TX_SEND_ACKED;
    }
    if (ack_result == TX_WAIT_LEVEL_CHANGED) {
      nrf24_power_down();
      return TX_SEND_RESTART_LEVEL;
    }
    if (ack_result == TX_WAIT_ABORTED) {
      nrf24_power_down();
      return TX_SEND_ABORTED;
    }

    if (attempt < DATA_MAX_RETRIES - 1) {
      tx_wait_result_t retry_result =
          service_runtime_window(runtime, DATA_RETRY_DELAY_MS,
                                 false, attempt, runtime->seq_num,
                                 *current_level, current_level);
      if (retry_result == TX_WAIT_LEVEL_CHANGED) {
        nrf24_power_down();
        return TX_SEND_RESTART_LEVEL;
      }
      if (retry_result == TX_WAIT_ABORTED) {
        nrf24_power_down();
        return TX_SEND_ABORTED;
      }
    }
  }

  nrf24_power_down();
  return TX_SEND_NO_ACK;
}

/* ========== TIM2 for millis (1ms) ========== */
void TIM2_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void TIM2_IRQHandler(void) {
  if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) {
    g_millis++;
    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
  }
}

void timer_init(void) {
  TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure = {0};
  NVIC_InitTypeDef NVIC_InitStructure = {0};
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

  // Period 9 and Prescaler for 1ms interrupt
  TIM_TimeBaseStructure.TIM_Period = 9;
  TIM_TimeBaseStructure.TIM_Prescaler = (SystemCoreClock / 10000) - 1;
  TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

  TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
  NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  TIM_Cmd(TIM2, ENABLE);
}

uint32_t millis(void) { return g_millis; }

/* ========== GPIO Init ========== */
void gpio_init(void) {
  GPIO_InitTypeDef GPIO_InitStructure = {0};
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOA, ENABLE);

  // Button: PD6 (Input Pull-up)
  GPIO_InitStructure.GPIO_Pin = BUTTON_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  // LED: PD2 (Output Push-pull)
  GPIO_InitStructure.GPIO_Pin = LED_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  GPIO_SetBits(GPIOD, LED_PIN); // Turn off at start (Active-Low)

  // Sensor Pins: PC0, PC1, PC2, PC4 (Input Pull-up)
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
  GPIO_InitStructure.GPIO_Pin =
      SENSOR_PIN_25 | SENSOR_PIN_50 | SENSOR_PIN_75 | SENSOR_PIN_100;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  // Initialize EXTI for these pins
  exti_init();
}

/**
 * @brief Reads all tank probes and applies software patches for hardware
 * reliability and fault monitoring.
 *
 * LOGIC EXPLANATION (Hardware Patch):
 * In a standard water tank, if a higher probe (e.g., 50%) is touching water,
 * all probes below it (e.g., 25%) MUST also be touching water.
 * If a lower probe wire is broken or the probe is oxidized, it might
 * report "Dry" even when the tank is half full.
 *
 * This function handles two critical tasks:
 * 1. PROBE FAULT DETECTION: It checks if there's a "gap" in readings (e.g.,
 *    100% is wet but 25% is dry). If a gap is found, it sets g_probe_fault=1
 *    to alert the user about possible broken wires or dirty sensors.
 *
 * 2. BROKEN WIRE FIX: Even if a lower probe is faulty, the function
 *    automatically fills in the gap in software to ensure the displayed
 *    water level remains accurate.
 *
 * Benefit: Prevents "jumpy" or incorrect readings and provides a "Service
 * Required" alert if hardware maintenance is needed.
 *
 * @return uint8_t Current water level (0, 25, 50, 75, or 100)
 */
uint8_t read_internal_probes(uint8_t *fault_out) {
  uint8_t p25 = (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_25) == 0);
  uint8_t p50 = (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_50) == 0);
  uint8_t p75 = (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_75) == 0);
  uint8_t p100 = (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_100) == 0);

  // --- FAULT DETECTION LOGIC: Bitmask Mode ---
  uint8_t fault_mask = 0;
  if (p100) {
    if (!p75)
      fault_mask |= (1 << 2);
    if (!p50)
      fault_mask |= (1 << 1);
    if (!p25)
      fault_mask |= (1 << 0);
  } else if (p75) {
    if (!p50)
      fault_mask |= (1 << 1);
    if (!p25)
      fault_mask |= (1 << 0);
  } else if (p50) {
    if (!p25)
      fault_mask |= (1 << 0);
  }

  if (fault_out)
    *fault_out = fault_mask;

