abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
  // --- HARDWARE PATCH: Broken Wire Fix ---
  if (p100) {
    p75 = 1;
    p50 = 1;
    p25 = 1;
  } else if (p75) {
    p50 = 1;
    p25 = 1;
  } else if (p50) {
    p25 = 1;
  }

  if (p100)
    return 100;
  if (p75)
    return 75;
  if (p50)
    return 50;
  if (p25)
    return 25;
  return 0;
}

uint8_t read_tank_level(void) {
  uint8_t f1, f2, f3;
  uint8_t r1 = read_internal_probes(&f1);
  Delay_Ms(2);
  uint8_t r2 = read_internal_probes(&f2);
  Delay_Ms(2);
  uint8_t r3 = read_internal_probes(&f3);

  // Combine ALL faults found in any sample
  g_probe_fault = f1 | f2 | f3;

  // Use median-of-3 instead of max-of-3 to avoid sticky high readings
  // during fast draining (e.g. 25% -> 0%).
  uint8_t min = r1;
  uint8_t max = r1;
  if (r2 < min)
    min = r2;
  if (r2 > max)
    max = r2;
  if (r3 < min)
    min = r3;
  if (r3 > max)
    max = r3;
  uint8_t best = (uint8_t)((uint16_t)r1 + (uint16_t)r2 + (uint16_t)r3 - min -
                           max);

  if (best > 0 || g_probe_fault > 0)
    DEBUG_PRINT("[DATA] Level: %d%% | Fault Mask: 0x%02X\r\n", best,
                g_probe_fault);
  return best;
}

/* ========== ADC for Battery Monitoring (PA1) ========== */
void adc_init(void) {
  ADC_InitTypeDef ADC_InitStructure = {0};
  GPIO_InitTypeDef GPIO_InitStructure = {0};

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_ADC1, ENABLE);
  RCC_ADCCLKConfig(RCC_PCLK2_Div8);

  GPIO_InitStructure.GPIO_Pin = BATTERY_ADC_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  ADC_DeInit(ADC1);
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = DISABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);

  ADC_Cmd(ADC1, ENABLE);

  // Calibration
  ADC_ResetCalibration(ADC1);
  while (ADC_GetResetCalibrationStatus(ADC1))
    ;
  ADC_StartCalibration(ADC1);
  while (ADC_GetCalibrationStatus(ADC1))
    ;
}

uint16_t get_adc_val(uint8_t ch) {
  ADC_RegularChannelConfig(ADC1, ch, 1, ADC_SampleTime_241Cycles);
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);
  volatile uint32_t timeout = 50000;
  while (!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) && --timeout)
    ;
  if (timeout == 0) {
    DEBUG_PRINT("[ADC] TIMEOUT ch%d!\r\n", ch);
    return 0;
  }
  return ADC_GetConversionValue(ADC1);
}

uint8_t read_battery_level(void) {
  // Integer-only battery calculation (no float library needed)
  uint32_t vref_sum = 0;
  for (int i = 0; i < 8; i++)
    vref_sum += get_adc_val(ADC_Channel_Vrefint);
  uint16_t vref_raw = vref_sum / 8;
  if (vref_raw == 0)
    return 0;

  uint32_t bat_sum = 0;
  for (int i = 0; i < 8; i++)
    bat_sum += get_adc_val(BATTERY_ADC_CHANNEL);
  uint16_t bat_raw = bat_sum / 8;

  // V_bat_mV = bat_raw * 1200 * 2 / vref_raw (for 100k/100k divider)
  uint32_t v_bat_mv = ((uint32_t)bat_raw * 2400) / vref_raw;

  DEBUG_PRINT("[BAT] %lumV\r\n", (unsigned long)v_bat_mv);

  // Map 3000mV-4200mV to 0-100%
  if (v_bat_mv >= 4200) return 100;
  if (v_bat_mv <= 3000) return 0;
  return (uint8_t)((v_bat_mv - 3000) * 100 / 1200);
}

/* ========== Auto-Generate Tank ID ========== */
uint16_t generate_new_tank_id(void) {
  // Generate a pseudo-random 16-bit ID using current millis
  // This ensures each reset produces a different ID
  uint32_t seed = millis();

  // Simple pseudo-random algorithm using bit manipulation
  seed = (seed ^ (seed << 13));
  seed = (seed ^ (seed >> 17));
  seed = (seed ^ (seed << 5));

  // Ensure ID is never 0x0000 (reserved for invalid)
  uint16_t new_id = (uint16_t)(seed & 0xFFFF);
  if (new_id == 0x0000) {
    new_id = 0x0001;
  }

  return new_id;
}

/* ========== Protocol Checksum (CRC-8) ========== */
uint8_t calculate_checksum(uint8_t *data, uint8_t length) {
  uint8_t crc = 0x00;
  for (uint8_t i = 0; i < length - 1; i++) {
    crc ^= data[i];
    for (uint8_t j = 0; j < 8; j++) {
      if (crc & 0x80)
        crc = (crc << 1) ^ 0x07; // Polynomial 0x07
      else
        crc <<= 1;
    }
  }
  return crc;
}

void run_pairing(void) {
  nrf24_init();
  Delay_Ms(100);

  uint16_t new_id = generate_new_tank_id();
  DEBUG_PRINT("\r\n[PAIR] NewID:0x%04X\r\n", new_id);

  // DO NOT save pairing_status yet - wait for controller ACK first
  uint8_t packet[32] = {0};
  packet[0] = 0xAA;
  packet[1] = 0x55;
  packet[2] = 0x01; // PKT_TYPE_PAIRING_REQ
  packet[3] = 32;
  packet[4] = (new_id & 0xFF);
  packet[5] = (new_id >> 8);
  packet[6] = read_tank_level();    // Level at index 6
  DEBUG_PRINT("[PAIR] Lvl:%d Reading bat...\r\n", packet[6]);
  packet[7] = read_battery_level(); // Battery at index 7
  DEBUG_PRINT("[PAIR] Bat:%d\r\n", packet[7]);
  packet[8] = 0x10;                 // Version at index 8
  packet[31] = calculate_checksum(packet, 32);

  DEBUG_PRINT("[PAIR] Pkt: ");
  for (int k = 0; k < 8; k++)
    DEBUG_PRINT("%02X ", packet[k]);
  DEBUG_PRINT("CRC:%02X\r\n", packet[31]);

  DEBUG_PRINT("[PAIR] Bcast %dmin bursts:%d ack:%dms\r\n",
              PAIRING_TIME_MINS,
              PAIRING_BURST_COUNT, PAIRING_ACK_WAIT_MS);

  bool paired = false;
  uint8_t ack_status = PAIRING_ACK_STATUS_TIMEOUT;

  for (int i = 0; i < PAIRING_BURST_COUNT && !paired; i++) {
    // LED blink pattern
    if ((i % 2) < 1)
      GPIO_ResetBits(GPIOD, LED_PIN);
    else
      GPIO_SetBits(GPIOD, LED_PIN);


    // 1. Send pairing request
    nrf24_power_up_tx();
    nrf24_set_tx_addr(PAIRING_ADDR);
    nrf24_send(packet, 32);

    // 2. Flush RX FIFO + switch to RX to listen for controller ACK
    nrf24_flush_rx();
    nrf24_power_up_rx();

    // 3. Wait for ACK from controller
    uint32_t start = millis();
    while ((millis() - start) < PAIRING_ACK_WAIT_MS) {
      if (nrf24_available()) {
        uint8_t rx_buf[32];
        nrf24_read(rx_buf, 32);

        DEBUG_PRINT("[PAIR] RX: S=%02X%02X T=%02X\r\n", rx_buf[0],
                    rx_buf[1], rx_buf[2]);

        // Check normal sync: 0xAA 0x55 + type 0x07 (PAIRING_RESP)
        if (rx_buf[0] == 0xAA && rx_buf[1] == 0x55 &&
            rx_buf[2] == PKT_TYPE_PAIRING_RESP) {
          uint8_t calc_crc = calculate_checksum(rx_buf, 32);
          uint16_t resp_id =
              (uint16_t)rx_buf[4] | ((uint16_t)rx_buf[5] << 8);

          DEBUG_PRINT("[PAIR] NSync RID:0x%04X MY:0x%04X "
                      "CC:%02X PC:%02X\r\n",
                      resp_id, new_id, calc_crc, rx_buf[31]);

