abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
          if (calc_crc == rx_buf[31] && resp_id == new_id) {
            ack_status = rx_buf[11]; // Status at offset 11
            DEBUG_PRINT("[PAIR] ACK st:%d\r\n", ack_status);

            if (ack_status == PAIRING_ACK_STATUS_PAIRED) {
              // NOW save - controller confirmed pairing is done
              g_settings.tank_id = new_id;
              g_settings.pairing_status = 1;
              flash_save_settings();
              paired = true;
              DEBUG_PRINT("[PAIR] OK! ID:0x%04X\r\n", new_id);
            }
            break;
          } else {
            DEBUG_PRINT("[PAIR] CRC/ID mismatch\r\n");
          }
        }

        // Check bit-inverted sync (NRF phase alignment workaround)
        {
          uint8_t inv[32];
          for (int j = 0; j < 32; j++)
            inv[j] = ~rx_buf[j];

          if (inv[0] == 0xAA && inv[1] == 0x55 &&
              inv[2] == PKT_TYPE_PAIRING_RESP) {
            uint8_t calc_crc = calculate_checksum(inv, 32);
            uint16_t resp_id =
                (uint16_t)inv[4] | ((uint16_t)inv[5] << 8);

            DEBUG_PRINT("[PAIR] InvSync RID:0x%04X MY:0x%04X "
                        "CC:%02X PC:%02X\r\n",
                        resp_id, new_id, calc_crc, inv[31]);

            if (calc_crc == inv[31] && resp_id == new_id) {
              ack_status = inv[11];
              DEBUG_PRINT("[PAIR] ACK(Inv) st:%d\r\n",
                          ack_status);

              if (ack_status == PAIRING_ACK_STATUS_PAIRED) {
                g_settings.tank_id = new_id;
                g_settings.pairing_status = 1;
                flash_save_settings();
                paired = true;
                DEBUG_PRINT("[PAIR] OK(Inv)! ID:0x%04X\r\n",
                            new_id);
              }
              break;
            } else {
              DEBUG_PRINT("[PAIR] Inv CRC/ID mismatch\r\n");
            }
          }
        }
      }
      Delay_Ms(1);
    }
  }

  GPIO_SetBits(GPIOD, LED_PIN); // LED OFF
  nrf24_power_down();

  if (paired) {
    // Success feedback: Fast 5x blink
    for (int i = 0; i < 5; i++) {
      GPIO_ResetBits(GPIOD, LED_PIN);
      Delay_Ms(100);
      GPIO_SetBits(GPIOD, LED_PIN);
      Delay_Ms(100);
    }
    DEBUG_PRINT("[PAIR] DONE\r\n");
  } else {
    // Failed: ensure NOT marked as paired
    g_settings.tank_id = 0;
    g_settings.pairing_status = 0;
    flash_save_settings();

    // Failure feedback: Slow 3x blink
    for (int i = 0; i < 3; i++) {
      GPIO_ResetBits(GPIOD, LED_PIN);
      Delay_Ms(500);
      GPIO_SetBits(GPIOD, LED_PIN);
      Delay_Ms(500);
    }
    DEBUG_PRINT("[PAIR] FAIL after %d tries\r\n",
                PAIRING_BURST_COUNT);
  }
}

/* ========== Main Loop ========== */
int main(void) {
  SystemCoreClockUpdate();
  Delay_Init();
  USART_Printf_Init(115200);

  DEBUG_PRINT("\r\n=== TANK BOOT ===\r\n");
  DEBUG_PRINT("CH32V003 @ %luHz\r\n",
              (unsigned long)SystemCoreClock);

  timer_init();
  gpio_init();
  adc_init();
  pwr_sleep_init();

  // SAFETY: Delay at boot to allow WCH-Link to connect before MCU sleeps.
  // This is the most reliable way to prevent "Lockout" during development.
  DEBUG_PRINT("[SYS] SafeDelay %dms.. ",
              BOOT_SAFETY_DELAY_MS);
  Delay_Ms(BOOT_SAFETY_DELAY_MS);
  DEBUG_PRINT("OK\r\n");

  __enable_irq();

  DEBUG_PRINT("Init Radio...\r\n");
  nrf24_init();
  nrf24_power_down(); // Start in low power mode

  // Load settings from Flash
  flash_read_settings();

  if (g_settings.pairing_status == 1) {
    DEBUG_PRINT("[SYS] Paired ID:0x%04X\r\n",
                g_settings.tank_id);
    nrf24_set_tx_addr(PAIRING_ADDR); // Ensure address is set
  } else {
    DEBUG_PRINT(
        "[SYS] NOT PAIRED. Hold button to pair\r\n");
  }

  // Boot UI: Triple blink (500ms ON, 500ms OFF)
  for (int i = 0; i < 3; i++) {
    GPIO_ResetBits(GPIOD, LED_PIN); // ON
    Delay_Ms(500);
    GPIO_SetBits(GPIOD, LED_PIN); // OFF
    Delay_Ms(500);
  }
  GPIO_SetBits(GPIOD, LED_PIN); // Extra safety: ensure LED is OFF

  DEBUG_PRINT("[SYS] Idle (Hold btn=pair)\r\n");

  reset_runtime_tracking(&g_runtime);

  while (1) {
    // 1. Button Handling
    if (g_button_event_pending || g_runtime.button_press_start != 0 ||
        GPIO_ReadInputDataBit(GPIOD, BUTTON_PIN) == 0) {
      g_button_event_pending = 0;

      button_action_t button_action = poll_button_action(&g_runtime);
      if (button_action != BUTTON_ACTION_NONE) {
        handle_button_action(&g_runtime, button_action);
        continue;
      }

      if (GPIO_ReadInputDataBit(GPIOD, BUTTON_PIN) == 0) {
        Delay_Ms(10);
        continue;
      }
    }

    // 2. Data Logic (Only if paired)
    if (g_settings.pairing_status == 1) {
      uint8_t current_level = sample_filtered_level(&g_runtime);
      bool level_changed = (current_level != g_runtime.last_sent_level);
      bool heartbeat_due =
          (g_runtime.sleep_cycle_count >= HEARTBEAT_CYCLES);

      // --- Battery Internal Logic ---
      if (g_runtime.last_sent_level == 0xFF || heartbeat_due) {
        g_runtime.current_battery = read_battery_level();
        DEBUG_PRINT("[BAT] Battery level: %d%%\r\n",
                    g_runtime.current_battery);
        Delay_Ms(100); // stabilize battery reading
      }

      // Send if: First time OR Level changed OR 4 hours heartbeat
      // But respect cooldown after failed ACK (wait ~1 min)
      bool need_send =
          (g_runtime.last_sent_level == 0xFF || level_changed ||
           heartbeat_due);

      if (level_changed) {
        // New data! Reset cooldown immediately
        g_runtime.retry_cooldown = 0;
      } else if (need_send && g_runtime.retry_cooldown > 0) {
        g_runtime.retry_cooldown--;
        if (g_runtime.retry_cooldown > 0) {
          need_send = false; // Still cooling down, skip this wake
          DEBUG_PRINT("[TX] Cooldown %d\r\n",
                      g_runtime.retry_cooldown);
        }
      }

      if (need_send) {
        uint8_t packet[32];
        bool ack_received = false;
        bool tx_aborted = false;
        bool send_attempted = false;
        bool show_tx_feedback = false;

        while (1) {
          level_changed =
              (current_level != g_runtime.last_sent_level);
          if (!(g_runtime.last_sent_level == 0xFF || level_changed ||
                heartbeat_due)) {
            break;
          }

          prepare_data_packet(packet, current_level);
          DEBUG_PRINT("[TX] %s Seq:%lu L:%d%% B:%d%% F:%d\r\n",
                      level_changed ? "CHG" : "HB",
                      (unsigned long)g_runtime.seq_num,
                      current_level, g_runtime.current_battery,
                      g_probe_fault);

          send_attempted = true;
          tx_send_result_t tx_result =
              send_data_with_retry(&g_runtime, packet, &current_level);

          if (tx_result == TX_SEND_RESTART_LEVEL) {
            g_runtime.retry_cooldown = 0;
            g_runtime.seq_num++;
            continue;
          }

          if (tx_result == TX_SEND_ABORTED) {
            tx_aborted = true;
            break;
          }

          ack_received = (tx_result == TX_SEND_ACKED);
          show_tx_feedback = true;
          if (!ack_received) {
            DEBUG_PRINT("[TX] NO ACK after %d tries\r\n",
                        DATA_MAX_RETRIES);
            g_runtime.retry_cooldown = 4;
          } else {
            g_runtime.last_sent_level = current_level;
            g_runtime.seq_num++;
            g_runtime.retry_cooldown = 0;
          }
          break;
        }

        if (tx_aborted) {
          continue;
        }

        if (send_attempted) {
          g_runtime.sleep_cycle_count = 0;

          if (show_tx_feedback) {
            // LED: fast blink=ACK ok, slow blink=no ACK
            GPIO_ResetBits(GPIOD, LED_PIN);
            Delay_Ms(ack_received ? 50 : 500);
            GPIO_SetBits(GPIOD, LED_PIN);
          }
        }
      }
    } else {
      DEBUG_PRINT("[SYS] Not paired\r\n");
      Delay_Ms(100);
    }

    // 3. Enter Deep Sleep
    if (g_settings.pairing_status == 1) {
      DEBUG_PRINT("[SYS] Sleep\r\n");
      DEBUG_PRINT("----------\r\n");
    }
    enter_deep_sleep();
    g_runtime.sleep_cycle_count++; // Increment cycles on each AWU wake
  }
}
